chars = "123ab45"
a = "".join(list(filter(str.isdigit, chars)))
print(a)
# 返回12345

b = list(filter(str.isdigit, '123ab45'))
print(b)
# 返回['1', '2', '3', '4', '5']

import re

string = "轻型车：共有198家企业4747个车型（12305个信息公开编号）15498915辆车进行了轻型车国六环保信息公开，与上周汇总环比增加105个车型、386379辆车。其中，国内生产企业177家、4217个车型、14645390辆，国外生产企业21家、530个车型、853525辆；轻型汽油"
a = []
a = re.findall("\d+\.?\d*", string)  # 正则表达式
print(a)
# 打印结果：['198', '4747', '12305', '15498915', '105', '386379', '177', '4217', '14645390', '21', '530', '853525']
# for i in range(len(a)):  # 列表a元素转化为int格式
#    a[i] = int(a[i])
a = list(map(int, a))  # 可以替代上面两行代码
print(a)
# 打印结果[198, 4747, 12305, 15498915, 105, 386379, 177, 4217, 14645390, 21, 530, 853525]
